/*  MARK: Задача #1.

    Возьмите любой пример из жизни (класс) и опишите уровни доступа к нему.
    Постарайтесь описать как публичные,, так и закрытые уровни и методы.
    Для решения задачи можно взять класс из предыдущего домашнего задания.
    
    1) Пример:
        Класс: такси
        Имеет публичный доступ, так как любой может воспользоваться отдельным экземпляром (объектом) такси.
        Пример геттера: узнать цену поездки
        Пример сеттера: установить конечную точку маршрута
        Пример публичного метода: заказать такси к определенному месту
        Пример приватного метода: доехать до клиента

    2) Допуск:
        В качестве примеров не используйте телевизор и пульт, так как это будет входить в следующие домашние задания.
        Постарайтесь описать, почему вы определили тот или иной уровень доступа. */


















/*  MARK: Задача #2.

    Создайте класс.
    Создайте 3 метода с одинаковым названием, но разными сигнатурами.
    Статический анализатор Swift подскажет вам, если overload не получится ;) */


















/*  MARK: Задача #3.

    Создайте класс-родитель. Определите в нем метод.
    Создайте класс-наследник. Переопределите в нем метод родителя, но с вызовом родительского метода.*/

















