//  MARK: - Задача #1.
/*  Вы разрабатываете библиотеку аудиотреков. Вам необходимо реализовать одну из категорий музыки, наполненную треками.
    Алгоритм выполнения:
    - Создайте объект трек.
    - Определите в нем свойства имя, исполнитель, длительность и страна.
    - Создайте класс категория.
    - Объявите в нем свойства название категории, список треков и количество треков в списке (экспериментируйте с "ленивыми" и вычисляемыми свойствами).
    - Определите методы добавления и удаления треков в эту категорию.*/
















//  MARK: - Задача #2.
/*  Доработайте свою библиотеку так, чтобы в ней было несколько категорий.
    Алгоритм выполнения: Создайте класс библиотеки. Этот класс будет аналогичен классу категории, только хранить он должен список категорий.*/

















//  MARK: - Задача #3.
//  Преобразуйте классы так, чтобы в пределах вашей библиотеки можно было обмениваться треками между категориями.
