




/*  // MARK: - Задача #1.
    
    1. Абстракиця:
        1.1 - С помощью абстракции можно описать класс какой-нибудь профессии, например космонавта, у которого должны быть строгие х-ки веса, роста, ума и т.д.
        1.2 - Абстракцию можно использовать для описания конкретных характиристик класса телефонов, у которых должен быть экран, функция звоноков, добавление sim-карты.
        1.3 - Абстракцию можно использовать для описания, конкретного химического элемента, у которого должны быть точные и подходящие именно для хм. элемента свойства, описывающие его в полной мере.
 
    2. Инкапсуляция:
        2.1 - Для класс космонавта, я бы запретил изменение физические параметров через св-ва, только с помощью методов набора или снижения веса, тренировок и т.д.
        2.2 - Для телефона, я могу завести св-во, которое отражает включено или выключено устройство, и сделал бы его приватным, чтобы изменить можно было только через метод.
 
    3. Наследование:
        3.1 - Можно использовать, для создания суперкласса столовых приборов (св-ва: материал, способ удержания в руке), и создать подклассы вроде ножа, влики, ложки и т.д.
        3.2 - Можно использовать, для создания суперкласса класса летающего аппарата (св-во: где именно может летать, длительность полета, высота полета), и создать подклассы вроде вертолета, ракеты и т.д.
 
    4. Полиморфизм:
        4.1 - Можно использовать для розетки, в которую можно вставить различные зарядные адаптеры и различные ус-ва.
        4.2 - Можно использоваться для бутылки, в которую можно поместить различную жидкость. */





/*  // MARK: - Задача #2.
 
    1. Класс:
        1.1 - Например, класс компьютера.
        1.2 - Например, класс планет.
        1.3 - Например, класс супергероя для игры.
 
    2. Объект:
        2.1 - Объектами этого класса, могут быть компьютеры разных марок, например: Mac или компьютер на Windows.
        2.2 - Объектами этого класса, будут различные планеты, такие как земля/марс/юпитер и т.д.
        2.3 - Объектами этого класса, стали бы все супергерои, которых я решил бы добавить в игру. Например объектом мог быть человек паук или халк.
 
    3. Свойства объектов:
        3.1 - Свойствами данных объектов может быть: операционная система, кол-во памяти, процессор, ноутбук это или стационарных пк, имеется ли экран и т.д.
        3.2 - Свойствами данных объектов, будут такие х-ки как: из чего состоит планета, имеет ли спутники, имеет ли жизнь, размер и т.д.
        3.3 - Свойствами данных объектов, могли бы стать: такие х-ки как: кол-во силы, суперспособность, возможность летать и т.д.
 
    4. Методы:
        4.1 - У компьютеров могут быть методы включения/выключения, замены компонентов и т.д.
        4.2 - Такой класс можно было бы применить, в игре-стратегии построения галактик, и планетам можно было создавать жизнь, добавлять и удалять спутники, иммитировать различную погоду.
        4.3 - Супергероии, могли бы пролетать или пробегать от точки к точке в зависимости от их характиристик, могли бы сражаться с врагами и т.д. */
