// MARK: - Задача #1.
print("👉 Задача #1.")

/*  Для каждого принципа ООП приведите 2-3 примера из жизни.
    - Абстракция;
    - Инкапсуляция;
    - Наследование;
    - Полиморфизм. */





// MARK: - Задача #2.
print("\n👉 Задача #2.")

/*  Для каждого базового понятия ООП приведите 2-3 примера из жизни. Опишите их текстом.
    - Класс;
    - Объект;
    - Свойства объектов;
    - Методы.

    ВАЖНО:
    В качестве примеров не используйте автомобиль и двигатель :) Это самые стандартные примеры, которые вам мог говорить преподаватель или вы прочли в интернете.
    Пожалуйста, подумайте над своими. Домашние работы только с примерами автомобиль и двигатель будут отправлены на доработку. */
